---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MEPAnalyticalSystem
source: html/764b0438-1fcd-9f39-775d-c7752e92b098.htm
---
# MEPAnalyticalSystem Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.